namespace MyMotoWorld.Data.Seeding
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Threading.Tasks;

    using MyMotoWorld.Data.Models;

    public class NewsSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.News.Any())
            {
                return;
            }

            var newsList = new List<News>();

            var news1 = new News
            {
                ImageName = "Snimka2",
                Name = "Сузуки Катана се завръща. Закален с турбо, подготвен да пореже конкуренцията",
                Description = "На изложението EICMA 2017 за първи път чухме за намеренията на Suzuki да върне името “Katana” на съвременния мотоциклетен пазар. Компанията представи Katana 3.0 Concept и замисляше да премине към производство, но някак си загуби инерцията и хората спряха да обсъждат темата. Сега обаче се появява нова информация, която подсказва, че Suzuki серизно възнамеряват да реализират идеята си. Наскоро японският производител е подал молба за запазване на търговска марка в САЩ за името “Katana” и ефектно ново лого с меча. Katana са спортни туринг мотоциклети, проектирани за първи път през 1979 г. за Suzuki от немското студио Target Design, като тези машини обикаляха улиците от 1981 до 2006 г., като част от ревизираната серия GSX-F. Сузуки произведоха след това няколко варианта на Katana 1100SZ от 1982 г. Излязоха също така верисии с 550 cc/куб. см., 650 cc и 750 cc в серията GSX. На EICMA 2017 Suzuki представи марката Katana, макар и само като концептуален модел, разработен от известния мотоциклетен дизайнер Родолфо Фрасколи. Новият модел е базиран на GSX-S1000F с дизайн, вдъхновен от Катаната от 80-те, участвала в мото съревнованията  за издръжливост и беше известна като кораво животно. Дизайнерските решения открито препращат към машините от миналото, като Suzuki демонстрират сериозни намерения да стигнат до етапа на производството. Ако малко поровите из спомените си, ще се сетите, че през 2013 г. Suzuki също така ни показаха своята концепция Recursion, която напомня дизайна на Katana от 80-те. Струва ни се, че точно това е пътят, който са избрали от компанията. Промотиран под името GSX-700T, този мотоциклет ще вкара Suzuki в света на турбокомпресорите и може би ще носи марката “Katana”. GSX-700T вече бе представен на всички търговци в Европа, като ще има 700-кубиков “XE7” двигател, който дава близо 150 к. с. сурова турбо мощност. Suzuki Motor Company отчаяно се нуждае от един или два модела, с които да укрепи нестабилното си присъствие, особено след слабото си представяне на EICMA 2017, където показаха единствено Suzuki SVX650 X. Може би именно GSX-700T ще ги спаси, както по отношение на продажбите, така и по отношение на популярността на марката. Като имаме предвид, че за нужни 4-5 години един мотоциклет да стигне от ниво концепция до етапа на производство, GSX-700T влиза точно в графика, с евентуално представяне в края на 2018 или през 2019 г. влизайки в канията на “Катаната”. Дали прераждането на Катана ще се състои и дали ще бъде опасно за конкурентите те първа предстои да видим.",
            };

            newsList.Add(news1);

            var news2 = new News
            {
                ImageName = "Snimka11",
                Name = "Suzuki на 100 години: историята от тъкачния стан до Хаябуса",
                Description = "Историята на Suzuki започва още през октомври 1909 г., когато Мичио Сузуки основава Suzuki Loom Works, като малка семейна компания – производител на тъкачни станове. Но официалното излизане на компанията на стоковата борса става през март 1920 г. под името Suzuki Loom Manufacturing Co, като тя започва да разширява производството си от станове към мотоциклети, автомобили и извънбордови двигатели. <br/> " +
                "Днес Suzuki Motor Corporation е мултинационална корпорация, но в своите корени и същност, тя, както и останалите членове на „Голямата четворка”, е японска. Седалището на компанията е в Хамамацу, префектура Шизуока – родното място на нейния основател Мичио Сузуки. Интересен е фактът, че Yamaha Motor Corporation също са родом от там и затова Хамамацу е известен като „града на мотоциклетите”. <br/>" +
                "През следващите години Мичио Сузуки усъвършенства своята продукция, като подпомага силно развитата текстилна промишленост на Япония по онова време. Бизнесът му процъфтява и находчивият японец разбира, че времето на дребния семеен бизнес е отминало.<br/> " +
                "Новата действителност го изправя пред нуждата от капитал, за да може компанията да разшири дейността си и да посрещне нарасналите нужди на текстилния сектор. Решението на Сузуки е да излезе на стоковата борса, което става реалност през март 1920 година. Тази дата се счита за рожденната на Suzuki Motor Corporation каквато я познаваме днес. Неслучайно компанията отбеляза своя 80-ти юбилей през 2000 година.<br/> " +
                "<br/>" +
                "Трансформацията <br/>" +
                "<br/>" +
                "След реорганизацията и преобразуването на компанията от 1920 година нужният капитал е събран, а Мичио Сузуки става президент на Suzuki Loom Manufactoring Company. Последвалите 15 години са белязани от безспорен търговски успех, въпреки който Сузуки вижда необходимостта от разнообразяване на продуктовия асортимент. Той започва да търси нови възможности и след известен проучвателен период стига до извода, че най-добрият продукт за японския пазар би бил лекият автомобил. Новата дейност стартира около 1937 и в рамките на две години Suzuki вече са готови с няколко прототипа на малък компактен автомобил. Тези разработки са оборудвани с тогава смятания за иновативен 4-тактов 4-цилиндров двигател с водно охлаждане и обем около 800 куб. см, който развивал мощност от 13 к.с.<br/> " +
                "С началото на Втората световна война обаче, плановете на Suzuki пропаднали, тъй като правителството заклеймило пътническите автомобили за цивилни лица като „ненужно удобство”. През войната производствените мощности на Suzuki навярно са използвани по един или друг начин за подпомагане на военните усилия на Империята. След края на войната Suzuki първоначално отново започват с производството на тъкачни машини, благодарение на факта, че САЩ разрешават доставките на памук за Япония. Бъдещето изглежда светло, но за кратко, защото пазарът на памук се срива през 1951 година.<br/> " +
                "<br/>" +
                "Първата двуколесна авантюра <br/>" +
                "<br/>" +
                "Това икономическо обстоятелство връща Suzuki към старите им планове за навлизане в автомобилната индустрия. След войната нуждата на населението от удобен и надежден личен транспорт става още по-голяма. Като различни фирми вече предлагат на пазара малки газови двигатели, пригодени за велосипеди. Така се появяват моторизираните велосипеди.<br/>" +
                "<br/>" +
                "1952 <br/>" +
                "<br/>" +
                "Той приличал много на обикновен велосипед с прикачен 36-кубиков двутактов двигател. Но Suzuki добавили доза гениалност, като сложили скоростна кутия с двойно зъбно колело, позволяваща преминаването от режим в режим, т.е. водачът можел да избира между въртене на педалите, изцяло двигателно задвижване или комбинация от двете. Нововъведението на японците се оказало истинска инженерна революция и патентният офис на новото демократично японско правителство отпуснало на Suzuki финансова субсидия, за да продължат с научноизследователската си работа в тази посока. През следващата година (1953) е създаден и вторият мотопед с марка Suzuki – Diamond Free, който донася и първите спортни успехи на компанията, като печели състезанието за изкачване на връх Фуджи.<br/> " +
                "<br/>" +
                "Първият мотоциклет <br/>" +
                "<br/>" +
                "До 1954 година Suzuki вече изцяло са преустроили своето производство и от поточната линия слизат по 6000 мотопеда на месец. А компанията официално е преименувана на Suzuki Motor Corporation.",
            };

            newsList.Add(news2);

            var news3 = new News
            {
                ImageName = "Snimka12",
                Name = "Кого избрахме да подкрепим в кампанията “Повече мото км с Meteo-Ride”",
                Description = "Температурите се покачват, а с тях и неудържимото желание да яхнем любимия мотор и да натиснем газта – към нови дестинации, по непокорени пътища, за да увеличим колекцията от приключения – надалеч, максимално далеч… Екипът ни се включва в сезонната мото лудост с желание да помогне на един от вас да стигне по - далеч, да види повече и да сподели с нас и Вас, нашите читатели, своите преживявания. Кампанията ни “Повече мото км с Meteo - Ride” приключи, но преди да обявим мото пътешественика, когото нашият екип избра да подкрепи това лято, бихме искали да благодарим на всички Вас, момчета и момичета, които се включихте, споделихте с нас плановете си за това лято и разказахте във форума на сайта за свои предишни пътувания.Иска ни се да можехме да подпомогнем пътешествието на всеки един от вас! Желаем Ви забавно и неповторимо мото лято с много завои, панорами и приключения. Бихме искали всички участници да имат малък сувенир за спомен от тазгодишната кампания “Повече мото км с Meteo - Ride”, затова ви каним да си изберете един стикер от новата ни серия и да се свържете с нас на meteo_ride@abv.bg, като ни посочите адреса, на който желаете да ви го изпратим. И така, приключенецът, който това лято ще пътешества с подкрепата на Mеteo-Ride, се казва Светослав Радулов. Светльо ще броди със своето Сузуки V-Strom из Австрийските Алпи, Франция, Германия, Англия, Шотландия и Норвегия от края на юни до средата на август. А заедно с него и ние ще имаме възможност да се насладим на красотите по прочутия North Coast 500 в Шотландия, шосе 63 с Тролстеген в Норвегия и много други.",
            };

            newsList.Add(news3);

            var news4 = new News
            {
                ImageName = "Snimka13",
                Name = "ТОП 10 факта за прохода Стелвио",
                Description = "Несъмнено проходът Стелвио е сред най - популярните пътища в света!  По подобие на Трансфагарашан, световната му слава дойде след включването му в епизодите на най - рейтинговото автомобилно предаване от началото на века.Не ни разбирайте погрешно, Пасо дело Стелвио е популярен панорамен път за свободния западен свят още преди войните, но благодарение на Топ Гиър за него научиха и във всички останали точки на планетата. огато се качат горе, обзети от емоциите, може би малцина обръщат внимание на факта, че стоят на място, където през вековете са се сблъсквали различни култури. Точно над хижата на прохода се намира Върхът на трите езика – “Piz da las Trais Linguas”. Там, където някога са се срещали границите на Италия, Австрия и Швейцария, е пресечната точка на италиански, немски и реторомански. Но Австрия, която е построила този път през 1825 г., е загубила Ломбардия и Южен Тирол в резултат на двете световни войни и днес те са част от Италия.Известно е, че проходът е използван още през Средновековието, но въпреки това не е толкова древен и знаменит като Сан Бернар или Мон Сени.Съвременният очерк е даден от австрийските инженери през XIX - ти век.Но трябва да се отбележи, че главният инженер и ръководител на проекта всъщност е италианец – Карло Донегани(1775–1845), който също така проектира Пасо Сплуга.За своите професионални заслуги той е удостоен от Фердинанд I с титлата рицар на Австрийската империя.Повече за историята на мястото можете да научите в музея на върха.",
            };

            newsList.Add(news4);

            var news5 = new News
            {
                ImageName = "Snimka12",
                Name = "ТОП 10 факта за прохода Стелвио",
                Description = "Несъмнено проходът Стелвио е сред най - популярните пътища в света!  По подобие на Трансфагарашан, световната му слава дойде след включването му в епизодите на най - рейтинговото автомобилно предаване от началото на века.Не ни разбирайте погрешно, Пасо дело Стелвио е популярен панорамен път за свободния западен свят още преди войните, но благодарение на Топ Гиър за него научиха и във всички останали точки на планетата. огато се качат горе, обзети от емоциите, може би малцина обръщат внимание на факта, че стоят на място, където през вековете са се сблъсквали различни култури. Точно над хижата на прохода се намира Върхът на трите езика – “Piz da las Trais Linguas”. Там, където някога са се срещали границите на Италия, Австрия и Швейцария, е пресечната точка на италиански, немски и реторомански. Но Австрия, която е построила този път през 1825 г., е загубила Ломбардия и Южен Тирол в резултат на двете световни войни и днес те са част от Италия.Известно е, че проходът е използван още през Средновековието, но въпреки това не е толкова древен и знаменит като Сан Бернар или Мон Сени.Съвременният очерк е даден от австрийските инженери през XIX - ти век.Но трябва да се отбележи, че главният инженер и ръководител на проекта всъщност е италианец – Карло Донегани(1775–1845), който също така проектира Пасо Сплуга.За своите професионални заслуги той е удостоен от Фердинанд I с титлата рицар на Австрийската империя.Повече за историята на мястото можете да научите в музея на върха.",
            };

            newsList.Add(news5);

            var news6 = new News
            {
                ImageName = "Snimka5",
                Name = "ТОП 10 факта за прохода Стелвио",
                Description = "Несъмнено проходът Стелвио е сред най - популярните пътища в света!  По подобие на Трансфагарашан, световната му слава дойде след включването му в епизодите на най - рейтинговото автомобилно предаване от началото на века.Не ни разбирайте погрешно, Пасо дело Стелвио е популярен панорамен път за свободния западен свят още преди войните, но благодарение на Топ Гиър за него научиха и във всички останали точки на планетата. огато се качат горе, обзети от емоциите, може би малцина обръщат внимание на факта, че стоят на място, където през вековете са се сблъсквали различни култури. Точно над хижата на прохода се намира Върхът на трите езика – “Piz da las Trais Linguas”. Там, където някога са се срещали границите на Италия, Австрия и Швейцария, е пресечната точка на италиански, немски и реторомански. Но Австрия, която е построила този път през 1825 г., е загубила Ломбардия и Южен Тирол в резултат на двете световни войни и днес те са част от Италия.Известно е, че проходът е използван още през Средновековието, но въпреки това не е толкова древен и знаменит като Сан Бернар или Мон Сени.Съвременният очерк е даден от австрийските инженери през XIX - ти век.Но трябва да се отбележи, че главният инженер и ръководител на проекта всъщност е италианец – Карло Донегани(1775–1845), който също така проектира Пасо Сплуга.За своите професионални заслуги той е удостоен от Фердинанд I с титлата рицар на Австрийската империя.Повече за историята на мястото можете да научите в музея на върха.",
            };

            newsList.Add(news6);

            var news7 = new News
            {
                ImageName = "Snimka6",
                Name = "ТОП 10 факта за прохода Стелвио",
                Description = "Несъмнено проходът Стелвио е сред най - популярните пътища в света!  По подобие на Трансфагарашан, световната му слава дойде след включването му в епизодите на най - рейтинговото автомобилно предаване от началото на века.Не ни разбирайте погрешно, Пасо дело Стелвио е популярен панорамен път за свободния западен свят още преди войните, но благодарение на Топ Гиър за него научиха и във всички останали точки на планетата. огато се качат горе, обзети от емоциите, може би малцина обръщат внимание на факта, че стоят на място, където през вековете са се сблъсквали различни култури. Точно над хижата на прохода се намира Върхът на трите езика – “Piz da las Trais Linguas”. Там, където някога са се срещали границите на Италия, Австрия и Швейцария, е пресечната точка на италиански, немски и реторомански. Но Австрия, която е построила този път през 1825 г., е загубила Ломбардия и Южен Тирол в резултат на двете световни войни и днес те са част от Италия.Известно е, че проходът е използван още през Средновековието, но въпреки това не е толкова древен и знаменит като Сан Бернар или Мон Сени.Съвременният очерк е даден от австрийските инженери през XIX - ти век.Но трябва да се отбележи, че главният инженер и ръководител на проекта всъщност е италианец – Карло Донегани(1775–1845), който също така проектира Пасо Сплуга.За своите професионални заслуги той е удостоен от Фердинанд I с титлата рицар на Австрийската империя.Повече за историята на мястото можете да научите в музея на върха.",
            };

            newsList.Add(news7);

            var news8 = new News
            {
                ImageName = "Snimka7",
                Name = "ТОП 10 факта за прохода Стелвио",
                Description = "Несъмнено проходът Стелвио е сред най - популярните пътища в света!  По подобие на Трансфагарашан, световната му слава дойде след включването му в епизодите на най - рейтинговото автомобилно предаване от началото на века.Не ни разбирайте погрешно, Пасо дело Стелвио е популярен панорамен път за свободния западен свят още преди войните, но благодарение на Топ Гиър за него научиха и във всички останали точки на планетата. огато се качат горе, обзети от емоциите, може би малцина обръщат внимание на факта, че стоят на място, където през вековете са се сблъсквали различни култури. Точно над хижата на прохода се намира Върхът на трите езика – “Piz da las Trais Linguas”. Там, където някога са се срещали границите на Италия, Австрия и Швейцария, е пресечната точка на италиански, немски и реторомански. Но Австрия, която е построила този път през 1825 г., е загубила Ломбардия и Южен Тирол в резултат на двете световни войни и днес те са част от Италия.Известно е, че проходът е използван още през Средновековието, но въпреки това не е толкова древен и знаменит като Сан Бернар или Мон Сени.Съвременният очерк е даден от австрийските инженери през XIX - ти век.Но трябва да се отбележи, че главният инженер и ръководител на проекта всъщност е италианец – Карло Донегани(1775–1845), който също така проектира Пасо Сплуга.За своите професионални заслуги той е удостоен от Фердинанд I с титлата рицар на Австрийската империя.Повече за историята на мястото можете да научите в музея на върха.",
            };

            newsList.Add(news8);

            var news9 = new News
            {
                ImageName = "Snimka10",
                Name = "ТОП 10 факта за прохода Стелвио",
                Description = "Несъмнено проходът Стелвио е сред най - популярните пътища в света!  По подобие на Трансфагарашан, световната му слава дойде след включването му в епизодите на най - рейтинговото автомобилно предаване от началото на века.Не ни разбирайте погрешно, Пасо дело Стелвио е популярен панорамен път за свободния западен свят още преди войните, но благодарение на Топ Гиър за него научиха и във всички останали точки на планетата. огато се качат горе, обзети от емоциите, може би малцина обръщат внимание на факта, че стоят на място, където през вековете са се сблъсквали различни култури. Точно над хижата на прохода се намира Върхът на трите езика – “Piz da las Trais Linguas”. Там, където някога са се срещали границите на Италия, Австрия и Швейцария, е пресечната точка на италиански, немски и реторомански. Но Австрия, която е построила този път през 1825 г., е загубила Ломбардия и Южен Тирол в резултат на двете световни войни и днес те са част от Италия.Известно е, че проходът е използван още през Средновековието, но въпреки това не е толкова древен и знаменит като Сан Бернар или Мон Сени.Съвременният очерк е даден от австрийските инженери през XIX - ти век.Но трябва да се отбележи, че главният инженер и ръководител на проекта всъщност е италианец – Карло Донегани(1775–1845), който също така проектира Пасо Сплуга.За своите професионални заслуги той е удостоен от Фердинанд I с титлата рицар на Австрийската империя.Повече за историята на мястото можете да научите в музея на върха.",
            };

            newsList.Add(news9);

            await dbContext.News.AddRangeAsync(newsList);
        }
    }
}
